export class TimeSch {
    constructor() {
        this.sch = [
            /*07*/['기상', '기상', '기상', '기상', '기상', '기상', '기상'],
            /*08*/['영어 단어', '영어 단어', '영어 단어', '영어 단어', '영어 단어', '영어 단어', '영어 단어'],
            /*09*/['영어 단어', '영어 단어', '영어 단어', '영어 단어', '영어 단어', '영어 단어', '시대인재 수업'],
            /*10*/['국어 인강', '국어 인강', '국어 인강', '국어 인강', '국어 인강', '국어 인강', '시대인재 수업'],
            /*11*/['국어 인강', '국어 인강', '국어 인강', '국어 인강', '국어 인강', '국어 인강', '시대인재 수업'],
            /*12*/['수학', '수학', '수학', '수학', '수학', '수학', '시대인재 수업'],
            /*13*/['점심', '점심', '점심', '점심', '점심', '점심', '점심'],
            /*14*/['영어 인강', '영어 인강', '수학 심층', '영어 인강', '영어 인강', '영어 인강', '영어 인강'],
            /*15*/['영어 인강', '영어 인강', '수학 심층', '영어 인강', '영어 인강', '영어 인강', '영어 인강'],
            /*16*/['영어 복습', '영어 복습', '수학 심층', '영어 복습', '영어 복습', '영어 복습', '영어 복습'],
            /*17*/['영어 복습', '영어 복습', '수학 심층', '영어 복습', '영어 복습', '영어 복습', '영어 복습'],
            /*18*/['저녁', '저녁', '저녁', '저녁', '저녁', '저녁', '저녁'],
            /*19*/['물리', '물리', '물리', '물리', '물리', '물리', '물리'],
            /*20*/['국어 복습', '국어 복습', '국어 복습', '국어 복습', '국어 복습', '국어 복습', '국어 복습'],
            /*21*/['시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습'],
            /*22*/['시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습'],
            /*23*/['시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습', '시대인재 복습'],
            /*24*/['자율', '자율', '자율', '자율', '자율', '자율', '자율'],
            /*01*/['수면', '수면', '수면', '수면', '수면', '수면', '수면'],
        ];

        this.sch_color = {
            // '기상' : 'Cfa9139',
            // '점심' : 'Cfac739',
            // '저녁' : 'Cfab039',
            // '자율' : 'Cfa7029',
            // '수면' : 'Cfadf39',
        
            '기상' : '',
            '점심' : '',
            '저녁' : '',
            '자율' : '',
            '수면' : '',
        
            '영어 단어' : 'Cfa4157 ',
            '영어 인강' : 'Cfa42c7',
            '영어 복습' : 'Cfa5b41',
        
            '수학' : 'C52affa',
            '수학 심층' : 'C527afa',
            '물리' : 'C52e5fa',
            
            '국어 인강' : 'C4bfa55',
            '국어 복습' : 'C87fa4a',
            '시대인재 수업' : 'Cfaf04b',
            '시대인재 복습' : 'C4bfa90',
        };
    }
}